import { getClientConfig } from "../config/client";
import { SubmitKey } from "../store/config";

const isApp = !!getClientConfig()?.isApp;

const mn = {
    NextChat: {
        SideBar: {
          ChatList: "ᠶᠠᠷᠢᠶᠠᠨ ᠤ᠋ ᠵᠢᠭᠰᠠᠭᠠᠯᠲᠠ",
          Manage: "ᠤᠳᠤᠷᠢᠳᠬᠤ",
          Exit: "ᠭᠠᠷᠬᠤ",
          NewChat: "ᠰᠢᠨ᠎ᠡ ᠶᠠᠷᠢᠶ᠎ᠠ",
          CountOfChats: (count: number) => `${count} ᠶᠠᠷᠢᠶ᠎ᠠ`,
          Select: "ᠰᠣᠩᠭᠣᠬᠤ"
        },
        ChatArea: {
          More: "ᠢᠯᠡᠭᠦᠦ ᠶᠡᠬᠡ",
          Return: "ᠪᠤᠴᠠᠬᠤ",
          ChatOptions: "ᠶᠠᠷᠢᠶᠠᠨ ᠤ᠋ ᠰᠣᠩᠭᠣᠯᠲᠠ",
          Send: "ᠢᠯᠡᠭᠡᠬᠦ",
          SendPrompt: "Enter ᠳᠦ ᠣᠷᠣᠭᠤᠯᠤᠭᠰᠠᠨ ᠢ᠋ᠶ᠋ᠠᠷ ᠢᠯᠡᠭᠡᠬᠦ᠂ Shift + Enter ᠳᠦ ᠣᠷᠣᠭᠤᠯᠤᠭᠰᠠᠨ ᠢ᠋ᠶ᠋ᠠᠷ ᠰᠢᠨ᠎ᠡ ᠮᠥᠷ ᠣᠷᠣᠭᠤᠯᠬᠤ",
          RolePlay: "ᠷᠣᠯᠢ ᠲᠣᠭᠯᠠᠬᠤ",
          SwitchModel: "ᠵᠠᠭᠪᠤᠷ ᠰᠣᠯᠢᠬᠤ",
          WebSearch: "ᠰᠦᠯᠵᠢᠶᠡᠨ ᠦ᠌ ᠬᠠᠶᠢᠯᠲᠠ",
          Scripting: "ᠰᠺᠷᠢᠫᠲ᠋ᠧᠵᠢᠭᠤᠯᠬᠤ",
          GenImage: "ᠵᠢᠷᠤᠭ ᠡᠭᠦᠰᠬᠡᠬᠦ",
          UploadFile: "ᠵᠢᠷᠤᠭ/ᠪᠠᠷᠢᠮᠲᠠ ᠪᠢᠴᠢᠭ ᠰᠠᠭᠤᠯᠭᠠᠬᠤ",
          ChatPlugins: "ᠶᠠᠷᠢᠶᠠᠨ ᠤ᠋ ᠨᠡᠮᠡᠯᠲᠡ",
          IntelligentOffice: "ᠤᠬᠠᠭᠠᠯᠢᠭ ᠣᠹᠹᠢᠰ",
          WordDoc: "Word ᠪᠠᠷᠢᠮᠲᠠ ᠪᠢᠴᠢᠭ",
          PDFDoc: "PDF ᠪᠠᠷᠢᠮᠲᠠ ᠪᠢᠴᠢᠭ",
          Audio: "ᠳᠠᠭᠤᠤ",
          DeleteChat: "ᠶᠠᠷᠢᠶ᠎ᠠ ᠤᠰᠠᠳᠬᠠᠬᠤ",
          ClearData: "ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠤᠰᠠᠳᠬᠠᠬᠤ",
          SelectRole: "ᠷᠣᠯᠢ ᠰᠣᠩᠭᠣᠬᠤ",
          SearchRole: "ᠷᠣᠯᠢ ᠬᠠᠶᠢᠬᠤ...",
          New: "ᠰᠢᠨ᠎ᠡ",
          Use: "ᠠᠰᠢᠭᠯᠠᠬᠤ",
          StopUse: "ᠠᠰᠢᠭᠯᠠᠬᠤ ᠪᠠᠨ ᠵᠣᠭᠰᠣᠬᠤ",
          SwitchedToModel: (model: string) => `${model=="regular"?"ᠡᠩ ᠦ᠋ᠨ":"ᠳᠡᠪᠰᠢᠯᠲᠡᠧᠲ"} ᠵᠠᠭᠪᠤᠷ ᠷᠤ ᠰᠣᠯᠢᠭᠰᠠᠨ`,
          ManagePlugins: "ᠨᠡᠮᠡᠯᠲᠡ ᠤᠳᠤᠷᠢᠳᠬᠤ",
          AlreadyDeletedChat: "ᠤᠰᠠᠳᠬᠠᠭᠰᠠᠨ ᠶᠠᠷᠢᠶ᠎ᠠ",
          ClearDataPrompt: "ᠡᠨᠡ ᠨᠢ ᠪᠦᠬᠦ ᠲᠣᠬᠢᠷᠠᠭᠤᠯᠭ᠎ᠠ᠂ ᠶᠠᠷᠢᠶᠠᠨ ᠤ᠋ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠢ᠋ ᠤᠰᠠᠳᠬᠠᠵᠤ ᠪᠣᠯᠤᠨ᠎ᠠ᠃ ᠦᠷᠭᠦᠯᠵᠢᠯᠡᠭᠦᠯᠬᠦ ᠦ?",
          Activated: (name:string) => `${name} ᠢᠳᠡᠪᠬᠢᠵᠢᠭᠰᠠᠨ`,
          Deactivated: (name:string) => `${name} ᠵᠣᠭᠰᠣᠭᠠᠭᠰᠠᠨ`,
          Copy: "ᠬᠠᠭᠤᠯᠪᠤᠷᠢᠯᠠᠬᠤ",
          Delete: "ᠤᠰᠠᠳᠬᠠᠬᠤ",
          Retry: "ᠳᠠᠬᠢᠨ ᠣᠷᠣᠯᠳᠣᠯᠭ᠎ᠠ",
          Using: "ᠠᠰᠢᠭᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ",
          Greeting: "ᠲᠠ ᠶᠠᠮᠠᠷ ᠨᠢᠭᠡᠨ ᠲᠤᠰᠠᠯᠠᠮᠵᠢ ᠬᠡᠷᠡᠭᠲᠡᠢ ᠪᠣᠢ 🪄",
          Revert: "ᠪᠤᠴᠠᠭᠠᠬᠤ",
          DefaultTopic: "ᠰᠢᠨ᠎ᠡ ᠶᠠᠷᠢᠶ᠎ᠠ",
          KnowledgeBase: "ᠮᠡᠳᠡᠯᠭᠡ ᠶ᠋ᠢᠨ ᠪᠠᠭᠠᠵᠢ"
        }
    },

    "DevPage": {
      "RolePlay": "ᠲᠥᠷᠥᠯ ᠤᠷᠤᠭᠤᠯ",
      "Live2D": "Live2D",
      "Script": "ᠰᠺᠷᠢᠫ ᠲᠦ᠍",
      "Alter": "ᠥᠭᠡᠷᠡᠴᠢᠯᠡᠬᠦ",
      "RoleName": "ᠲᠥᠷᠥᠯ ᠦ᠋ᠨ ᠨᠡᠷ᠎ᠡ᠄ ",
      "Prompt": "ᠣᠷᠢᠶᠠᠯᠭ᠎ᠠ ᠶ᠋ᠢᠨ ᠦᠭᠡ᠄ ",
      "InitDialog": "ᠡᠬᠢᠯᠡᠭᠡᠳ ᠶᠠᠷᠢᠶ᠎ᠠ᠄ ",
      "User": "ᠬᠡᠷᠡᠭᠯᠡᠭᠴᠢ",
      "System": "ᠰᠢᠰᠲ᠋ᠧᠮ",
      "Append": "ᠨᠡᠮᠡᠬᠦ",
      "AutoGen": "ᠠᠦ᠋ᠲ᠋ᠣᠮᠠᠲ ᠢ᠋ᠶ᠋ᠠᠷ ᠡᠭᠦᠰᠬᠡᠬᠦ",
      "Clear": "ᠠᠷᠢᠭᠤᠨ",
      "ActivateTool": "ᠢᠳᠡᠪᠬᠡᠵᠢᠭᠦᠯᠬᠦ ᠴᠢᠳᠠᠪᠤᠷᠢ᠄ ",
      "WebSearch": "ᠰᠦᠯᠵᠢᠶᠡᠨ ᠦ᠌ ᠬᠠᠶᠢᠯᠲᠠ",
      "ImageGen": "ᠵᠢᠷᠤᠭ ᠡᠭᠦᠰᠬᠡᠬᠦ",
      "Scripting": "ᠰᠺᠷᠢᠫᠲᠦ ᠶ᠋ᠢᠨ ᠭᠦᠢᠴᠡᠳᠬᠡᠯ",
      "Upload": "ᠳᠡᠪᠰᠢᠭᠦᠯᠬᠦ",
      "Save": "ᠬᠠᠳᠠᠭᠠᠯᠠᠬᠤ",
      "Export": "ᠡᠺᠰᠫᠣᠷᠲᠯᠠᠬᠤ",
      "ChangeModel": "ᠵᠠᠭᠪᠤᠷ ᠰᠣᠯᠢᠬᠤ",
      "Send": "ᠢᠯᠡᠭᠡᠬᠦ",
      Greeting: "ᠲᠠ ᠶᠠᠮᠠᠷ ᠨᠢᠭᠡᠨ ᠲᠤᠰᠠᠯᠠᠮᠵᠢ ᠬᠡᠷᠡᠭᠲᠡᠢ ᠪᠣᠢ 🪄",
      "Expand": "ᠨᠡᠭᠡᠭᠡᠬᠦ",
      "Collapse": "ᠪᠠᠭᠤᠬᠤ",
      "Stop": "ᠵᠣᠭᠰᠣᠬᠤ"
    },

    "KnowledgeBase": {
      "New": "ᠰᠢᠨ᠎ᠡ ",
      "WhatsThis": "ᠡᠨᠡ ᠶᠠᠭᠤ ᠪᠣᠢ?",
      "Explaination": `ᠲᠣᠮᠣ ᠶᠣᠰᠣᠷ ᠤ᠋ᠨ ᠵᠠᠭᠪᠤᠷ ᠤ᠋ᠳ ᠨᠢ ᠰᠤᠷᠭᠠᠯᠠᠬᠤ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠴᠠᠭ ᠬᠤᠭᠤᠴᠠᠭᠠᠨ ᠤ᠋ ᠬᠢᠵᠠᠭᠠᠷᠯᠠᠯ ᠳ᠋ᠤ᠌᠂ ᠴᠣᠭᠴᠠᠯᠠᠪᠤᠷᠢ ᠪᠠᠢᠳᠠᠯ ᠠ᠋ᠴᠠ ᠰᠢᠯᠲᠠᠭᠠᠯᠵᠢᠭᠰᠠᠨ ᠲᠤᠯᠠ ᠲᠣᠳᠣᠷᠬᠠᠢ ᠠᠰᠠᠭᠤᠯᠲᠠ ᠨᠤᠭᠤᠳ ᠤ᠋ᠨ ᠬᠠᠷᠢᠭᠤ ᠨᠢ ᠵᠥᠪ ᠪᠤᠷᠤᠭᠤ᠂ ᠴᠠᠭ ᠠᠯᠠᠳᠠᠯ ᠦᠭᠡᠢ ᠪᠠᠢᠵᠤ ᠪᠣᠯᠬᠤ ᠶᠤᠮ᠃ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠨ ᠷᠤ ᠥᠪᠡᠷ ᠦ᠋ᠨ ᠵᠣᠷᠢᠭᠤᠯᠤᠯᠲᠠ ᠲᠠᠢ ᠪᠠᠷᠢᠮᠲᠠ ᠪᠢᠴᠢᠭ ᠨᠡᠮᠡᠵᠦ᠂ ᠲᠣᠮᠣ ᠶᠣᠰᠣᠷ ᠤ᠋ᠨ ᠵᠠᠭᠪᠤᠷ ᠠᠰᠠᠭᠤᠯᠲᠠ ᠳ᠋ᠤ᠌ ᠬᠠᠷᠢᠭᠤᠯᠬᠤ ᠦᠶ᠎ᠡ ᠳ᠋ᠦ᠍ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠨ ᠷᠤ ᠨᠡᠪᠲᠡᠷᠡᠬᠦ ᠪᠣᠯᠤᠮᠵᠢ ᠶ᠋ᠢ ᠣᠯᠭᠣᠬᠤ ᠵᠠᠮ ᠢ᠋ᠶ᠋ᠠᠷ ᠡᠳᠡᠭᠡᠷ ᠨᠥᠬᠥᠴᠡᠯ ᠪᠠᠢᠳᠠᠯ ᠢ᠋ ᠰᠠᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠪᠣᠯᠤᠮᠵᠢ ᠲᠠᠢ᠃
      
ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠩ ᠰᠢᠨ᠎ᠡ ᠠᠭᠤᠰᠬᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠤᠯᠠᠳᠠ ᠲᠠ ᠪᠠᠷᠠᠭᠤᠨ ᠳᠣᠭᠣᠳᠤ ᠲᠠᠯ᠎ᠠ ᠳ᠋ᠤ᠌ 《ᠰᠢᠨ᠎ᠡ》 ᠲᠣᠪᠴᠢᠯᠠᠭᠤᠷ ᠢ᠋ ᠳᠠᠷᠤᠵᠤ᠂ ᠤᠤսᠭᠡᠬᠦ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠩ ᠤ᠋ᠨ ᠲᠥᠷᠥᠯ ᠰᠣᠩᠭᠣᠨ᠎ᠠ᠃ ᠤᠯᠠᠮᠵᠢᠯᠠᠯᠲᠤ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠩ ᠨᠢ ᠪᠠᠷᠢᠮᠲᠠ ᠪᠢᠴᠢᠭᠢᠨᠡᠰ ᠲᠦᠯᠬᠢᠭᠦᠷ ᠦᠭᠡ ᠭᠠᠷᠭᠠᠵᠤ᠂ ᠡᠷᠭᠢᠨ ᠲᠣᠭᠣᠷᠢᠨ ᠳ᠋ᠤ᠌ ᠪᠠᠨ ᠲᠦᠯᠬᠢᠭᠦᠷ ᠦᠭᠡ ᠨᠢ ᠲᠣᠬᠢᠷᠠᠬᠤ ᠪᠣᠯᠭᠠᠨ᠎ᠠ᠃ ᠸᠧᠺᠲ᠋ᠣᠷ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠩ ᠨᠢ ᠪᠢᠴᠢᠭ ᠢ᠋ ᠥᠨᠳᠥᠷ ᠬᠡᠮᠵᠢᠶᠡᠰᠦ ᠳ᠋ᠦ᠍ ᠣᠷᠣᠨ ᠵᠠᠢ ᠶ᠋ᠢᠨ ᠴᠢᠭᠯᠡᠯ (ᠲ.ᠶᠠ ᠸᠧᠺᠲ᠋ᠣᠷ) ᠪᠣᠯᠭᠠᠨ ᠲᠣᠳᠣᠷᠬᠠᠢᠯᠠᠵᠤ᠂ ᠸᠧᠺᠲ᠋ᠣᠷ ᠪᠣᠯᠤᠨ ᠸᠧᠺᠲ᠋ᠣᠷ ᠬᠣᠭᠣᠷᠣᠨᠳᠣ ᠶ᠋ᠢᠨ ᠥᠨᠴᠥᠭ ᠲᠦ᠍ ᠬᠠᠷᠢᠴᠠᠭᠤᠯᠵᠤ ᠲᠣᠬᠢᠷᠠᠬᠤ ᠪᠣᠯᠭᠠᠨ᠎ᠠ᠃ ᠭᠷᠠᠹᠢᠺ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠩ ᠨᠢ ᠡᠬᠢ ᠰᠤᠷᠪᠤᠯᠵᠢ ᠶ᠋ᠢᠨ ᠲᠧᠺᠰᠲ ᠡᠴᠡ ᠪᠡᠶᠡᠲᠦ ᠨᠦ᠍ᠭᠦᠳ ᠪᠣᠯᠤᠨ ᠪᠡᠶᠡᠲᠦ ᠨᠦ᠍ᠭᠦᠳ ᠦ᠋ᠨ ᠬᠣᠭᠣᠷᠣᠨᠳᠣ ᠶ᠋ᠢᠨ ᠬᠠᠷᠢᠯᠴᠠᠭ᠎ᠠ ᠶ᠋ᠢ ᠭᠠᠷᠭᠠᠵᠤ᠂ ᠰᠦᠯᠵᠢᠶ᠎ᠡ ᠪᠣᠯᠵᠤ᠂ ᠡᠷᠭᠢᠨ ᠲᠣᠭᠣᠷᠢᠨ ᠳ᠋ᠤ᠌ ᠪᠠᠨ ᠴᠠᠭ ᠤ᠋ᠳ ᠤ᠋ᠨ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠢ᠋ ᠡᠷᠭᠢᠨ ᠲᠣᠭᠣᠷᠢᠨ ᠳ᠋ᠤ᠌ ᠪᠠᠨ ᠰᠢᠯᠵᠢᠨ᠎ᠡ᠃

ᠲᠠ ᠢᠨᠲ᠋ᠧᠷᠹᠡᠢᠰ ᠳᠡᠭᠡᠷ᠎ᠡ ᠥᠪᠡᠷ ᠦ᠋ᠨ ᠪᠣᠢ ᠪᠣᠯᠭᠠᠭᠰᠠᠨ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠨ ᠬᠠᠷᠠᠬᠤ ᠪᠣᠯᠤᠨ᠎ᠠ᠃ 《ᠵᠠᠰᠠᠪᠤᠷᠢᠯᠠᠬᠤ》 ᠢᠨᠲ᠋ᠧᠷᠹᠡᠢս ᠳᠣᠲᠣᠷ᠎ᠠ ᠲᠠ ᠰᠢᠨ᠎ᠡ ᠪᠠᠷᠢᠮᠲᠠ ᠪᠢᠴᠢᠭ ᠨᠡᠮᠡᠵᠦ᠂ ᠡᠰᠡᠪᠡᠯ ᠨᠡᠮᠡᠵᠦ ᠪᠣᠯᠤᠭᠰᠠᠨ ᠪᠠᠷᠢᠮᠲᠠ ᠪᠢᠴᠢᠭ ᠬᠠᠷᠠᠬᠤ ᠪᠣᠯᠤᠮᠵᠢ ᠲᠠᠢ᠃`,
      "ISee": "ᠣᠢᠯᠠᠭᠠᠭᠰᠠᠨ",
      "KeywordKB": "ᠤᠯᠠᠮᠵᠢᠯᠠᠯᠲᠤ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠨ",
      "VectorKB": "ᠸᠧᠺᠲ᠋ᠣᠷ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠨ",
      "GraphKB": "ᠭᠷᠠᠹᠢᠺ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠨ",
      "NewKB": (type) => `ᠰᠢᠨ᠎ᠡ ${type}`,
      "Name": "ᠨᠡᠷ᠎ᠡ",
      "Cancel": "ᠪᠣᠯᠢᠬᠤ",
      "Confirm": "ᠪᠠᠲᠤᠯᠠᠬᠤ",
      "SubTitle": (type, count) => `${type}, ${count} ᠪᠠᠷᠢᠮᠲᠠ ᠪᠢᠴᠢᠭ`,
      "Edit": "ᠵᠠᠰᠠᠪᠤᠷᠢᠯᠠᠬᠤ",
      "Delete": "ᠤᠰᠠᠳᠬᠠᠬᠤ",
      "EditKB": (name) => `ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠨ ${name} ᠵᠠᠰᠠᠪᠤᠷᠢᠯᠠᠬᠤ`,
      "AddDoc": "ᠪᠠᠷᠢᠮᠲᠠ ᠪᠢᠴᠢᠭ ᠨᠡᠮᠡᠬᠦ",
      "Done": "ᠳᠠᠭᠤᠰᠬᠠᠬᠤ",
      "DeleteKB": "ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠨ ᠤᠰᠠᠳᠬᠠᠬᠤ",
      "ConfirmDeleteKB": (name) => `ᠲᠠ ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠨ ${name} ᠤᠰᠠᠳᠬᠠᠬᠤ ᠶ᠋ᠢ ᠬᠢᠬᠦ ᠬᠦᠰᠡᠭᠰᠡᠨ ᠦ?`,
      "KBNameNotEmpty": "ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠨ ᠤ᠋ ᠨᠡᠷ᠎ᠡ ᠬᠣᠭᠣᠰᠣᠨ ᠪᠠᠢᠵᠤ ᠪᠣᠯᠬᠤ ᠦᠭᠡᠢ",
      "KBAlreadyExists": "ᠮᠡᠳᠡᠭᠡᠯᠡᠯ ᠦ᠋ᠨ ᠰᠠᠩ ᠠᠯᠢ ᠬᠡᠳᠦᠢᠨ ᠪᠠᠢᠨ᠎ᠠ",
      "SuccessfullyCreatedKB": (type, name) => `${type} ${name} ᠠᠮᠵᠢᠯᠲᠠᠲᠠᠢ ᠪᠣᠢ ᠪᠣᠯᠤᠭᠰᠠᠨ`,
      "SuccessfullyAddDocument": "ᠪᠠᠷᠢᠮᠲᠠ ᠪᠢᠴᠢᠭ ᠠᠮᠵᠢᠯᠲᠠᠲᠠᠢ ᠨᠡᠮᠡᠭᠳᠡᠭᠰᠡᠨ",
      "SuccessfullyDeletedDocument": (name) => `${name} ᠠᠮᠵᠢᠯᠲᠠᠲᠠᠢ ᠤᠰᠠᠳᠬᠠᠭᠳᠠᠭᠰᠠᠨ`
    }
};

type DeepPartial<T> = T extends object
  ? {
      [P in keyof T]?: DeepPartial<T[P]>;
    }
  : T;

export type LocaleType = typeof mn;
export type PartialLocaleType = DeepPartial<typeof mn>;

export default mn;
// Translated by @chunkiuuu, feel free the submit new pr if there are typo/incorrect translations :D
